###############################################################
# 프로젝트 환경 변수
###############################################################
variable "env" {
  type = string
  default = "<%= expansion(':ENV') %>"
}

###############################################################
# 프로젝트 서비스 이름
###############################################################
variable "svr_nm" {
  type = string
}

###############################################################
# 생성할 클러스터 버전
###############################################################
variable "cluster_version" {
  type = string
}

###############################################################
# 클러스터 마스터 노드에 접근하기 위한 CIDR Block (workstation)
###############################################################
variable "workstation_cidr" {
  type = list(string)
}

###############################################################
# 생성된 vpc id
################################################################
variable "vpc_id" {
    type = string
}

###############################################################
# 클러스터와 노드를 생성하기 위한 대상 서브넷
###############################################################
# 1. public 서브넷
variable "public_subnet_ids" {
    type = list(string)
}

# 2. private 서브넷
variable "private_subnet_ids" {
    type = list(string)
}

###############################################################
# AWS KMS ARN
###############################################################
variable "kms_key_arn" {
    type = string
}

###############################################################
# PORT 정보 사전정의
###############################################################
variable "ports" {
  type = object(
  {
    ssh_port = number
    db_port = number
    http_port = number
    https_port = number
    node_from_port = number
    node_to_port = number
    any_port = number
    any_protocol = string
    tcp_protocol = string
    all_ips = list(string)
  })
}